<a href="https://colab.research.google.com/github/rakelup/DESU-IA4PH-Info-PROF/blob/main/Introduction_to_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DESU IA4 HEALH
#Info-PROF, Introduction to Python programming for health data

#Session 2: Introduction to PANDAS

#Leaning objectives


1. Learning the different data types in pandas: Data frame and series
2. Importing and exporting data into a data frame
2. Subseting data frames
5. Doing transformations with dataframes

##What is Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Pandas on-line documentation :
 https://pandas.pydata.org/docs/reference/index.html

In [19]:
#Importing Pandas and verifying the version
import pandas as pd # as allows to create an alias
import numpy as np

print(pd.__version__) #allow to verify the pandas function

1.1.5

##Data types on Pandas :


1.   **Series :** It is a one-dimensional array holding data of any type.
2.  **Dataframes :** Multidimensional data tables holding data of any type. We can think that the series are like the columns of a dataframe whereas the whole table is the dataframe.

In [2]:
# Example series with labels


a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

## Dataframes 
Dataframes are multidiomensional matrices that can store data of different types.

In [4]:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45],
  "category" : ['a','b','c']
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration category
day1       420        50        a
day2       380        40        b
day3       390        45        c

In [ ]:
students = [ ('jack', 34, 'Sydeny') ,
             ('Riti', 30, 'Delhi' ) ,
             ('Aadi', 16, 'New York') ]
# Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City'], index=['a', 'b', 'c'])

**Exercise :** Create a dataframe that stores in one row the person ID, height, weight, sex  and  birthdate. Add at least three examples


##[DataFrame attributes](https://pandas.pydata.org/docs/reference/frame.html)

Exercise : For the dataframe previously created, go to dataframe attributes and show the following information : 
1. Number of elements
2. Name of the columns
3. Name of the rows
4. Number of rows and columns
5. Show the first rows of the dataframe

##Acces the elements of a dataframe :

Access by columns:

In [8]:
df['calories']

day1    420
day2    380
day3    390
Name: calories, dtype: int64

###DataFrame.loc | Select Column & Rows by Name
DataFrame provides indexing label loc for selecting columns and rows by names 

dataFrame.loc[ROWS RANGE , COLUMNS RANGE]

In [9]:
df.loc['day1',:]

calories    420
duration     50
category      a
Name: day1, dtype: object

In [10]:
df.loc[:,'calories']

day1    420
day2    380
day3    390
Name: calories, dtype: int64

###DataFrame.iloc | Select Column Indexes & Rows Index Positions
DataFrame provides indexing label iloc for accessing the column and rows by index positions i.e.
*dataFrame.iloc[ROWS INDEX RANGE , COLUMNS INDEX RANGE]*

It selects the columns and rows from DataFrame by index position specified in range. If ‘:’ is given in rows or column Index Range then all entries will be included for corresponding row or column.

In [16]:
df.iloc[:,[0,2]]

      calories category
day1       420        a
day2       380        b
day3       390        c

###Variable conversion :

In [ ]:
df_petit = pd.DataFrame({ 'Country': ['France','Spain','Germany', 'Spain','Germany', 'France', 'Italy'], 'Age': [50,60,40,20,40,30, 20] })
df_petit

   Country  Age
0   France   50
1    Spain   60
2  Germany   40
3    Spain   20
4  Germany   40
5   France   30
6    Italy   20

####Label encoding : 
Label Encoding refers to converting the labels into a numeric form so as to convert them into the machine-readable form. Machine learning algorithms can then decide in a better way how those labels must be operated. It is an important pre-processing step for the structured dataset in supervised learning.

In [ ]:
df_petit['Country_cat'] = df_petit['Country'].astype('category').cat.codes
df_petit

   Country  Age  Country_cat
0   France   50            0
1    Spain   60            3
2  Germany   40            1
3    Spain   20            3
4  Germany   40            1
5   France   30            0
6    Italy   20            2

#### One hot encoding

In [5]:
help(pd.get_dummies)

Help on function get_dummies in module pandas.core.reshape.reshape:

get_dummies(data, prefix=None, prefix_sep='_', dummy_na=False, columns=None, sparse=False, drop_first=False, dtype=None) -> 'DataFrame'
    Convert categorical variable into dummy/indicator variables.

    Parameters
    ----------
    data : array-like, Series, or DataFrame
        Data of which to get dummy indicators.
    prefix : str, list of str, or dict of str, default None
        String to append DataFrame column names.
        Pass a list with length equal to the number of columns
        when calling get_dummies on a DataFrame. Alternatively, `prefix`
        can be a dictionary mapping column names to prefixes.
    prefix_sep : str, default '_'
        If appending prefix, separator/delimiter to use. Or pass a
        list or dictionary as with `prefix`.
    dummy_na : bool, default False
        Add a column to indicate NaNs, if False NaNs are ignored.
    columns : list-like, default None
        Column names in the DataFrame to be encoded.
        If `columns` is None then all the columns with
        `object` or `category` dtype will be converted.
    sparse : bool, default False
        Whether the dummy-encoded columns should be backed by
        a :class:`SparseArray` (True) or a regular NumPy array (False).
    drop_first : bool, default False
        Whether to get k-1 dummies out of k categorical levels by removing the
        first level.
    dtype : dtype, default np.uint8
        Data type for new columns. Only a single dtype is allowed.

        .. versionadded:: 0.23.0

    Returns
    -------
    DataFrame
        Dummy-coded data.

    See Also
    --------
    Series.str.get_dummies : Convert Series to dummy codes.

    Examples
    --------
    >>> s = pd.Series(list('abca'))

    >>> pd.get_dummies(s)
       a  b  c
    0  1  0  0
    1  0  1  0
    2  0  0  1
    3  1  0  0

    >>> s1 = ['a', 'b', np.nan]

    >>> pd.get_dummies(s1)
       a  b
    0  1  0
    1  0  1
    2  0  0

    >>> pd.get_dummies(s1, dummy_na=True)
       a  b  NaN
    0  1  0    0
    1  0  1    0
    2  0  0    1

    >>> df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'],
    ...                    'C': [1, 2, 3]})

    >>> pd.get_dummies(df, prefix=['col1', 'col2'])
       C  col1_a  col1_b  col2_a  col2_b  col2_c
    0  1       1       0       0       1       0
    1  2       0       1       1       0       0
    2  3       1       0       0       0       1

    >>> pd.get_dummies(pd.Series(list('abcaa')))
       a  b  c
    0  1  0  0
    1  0  1  0
    2  0  0  1
    3  1  0  0
    4  1  0  0

    >>> pd.get_dummies(pd.Series(list('abcaa')), drop_first=True)
       b  c
    0  0  0
    1  1  0
    2  0  1
    3  0  0
    4  0  0

    >>> pd.get_dummies(pd.Series(list('abc')), dtype=float)
         a    b    c
    0  1.0  0.0  0.0
    1  0.0  1.0  0.0
    2  0.0  0.0  1.0

In [ ]:

df_petit = pd.get_dummies(df_petit,prefix=['Country'], columns = ['Country'], drop_first=True)
df_petit.head()

   Age  Country_cat  Country_Germany  Country_Italy  Country_Spain
0   50            0                0              0              0
1   60            3                0              0              1
2   40            1                1              0              0
3   20            3                0              0              1
4   40            1                1              0              0

**Exercise :** Create a dataframe with 3 columns with the characteristics : ID, sex (M or F), frailty degree (FB, M, F).  Convert the categorical variables using label encoding and one-hot-encoding.

#Dealing with dates 
https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [20]:
#Library to deeal with dates
import datetime

In [22]:
dti = pd.to_datetime(
    ["1/1/2018", np.datetime64("2018-01-01"), datetime.datetime(2018, 1, 1)]
)
dti

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01'], dtype='datetime64[ns]', freq=None)

In [23]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

### Cutomize the date format

In [26]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

**Exercise :** Check the Pandas documentation and create a dataframe with a columns with dates and try different datetypes.

###Access date elements dt. accessor :
The dt. accessor is an object that allows to access the different data and time elements in a datatime object.
https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html

In [30]:
df['date_only'] = df['date'].dt.date

df['time_only'] = df['date'].dt.time

df['hour_only'] = df['date'].dt.hour

df

                 date  value   date_only  hour_only time_only
0 2016-10-06 20:30:00      2  2016-10-06         20  20:30:00
1 2016-01-07 19:45:30      3  2016-01-07         19  19:45:30
2 2013-12-10 04:05:01      4  2013-12-10          4  04:05:01

#Importing datasets

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [31]:
df = pd.read_csv("https://raw.githubusercontent.com/rakelup/EPICLIN2021/master/diabetes.csv", sep=",",error_bad_lines=False)
df.head()

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

### Data overview

In [32]:
# Data overview
print ('Rows     : ', df.shape[0])
print ('Coloumns  : ', df.shape[1])
print ('\nFeatures : \n', df.columns.tolist())
print ('\nNumber of Missing values:  ', df.isnull().sum().values.sum())
print ('\nNumber of unique values :  \n', df.nunique())

Rows     :  768
Coloumns  :  9

Features :
 ['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin', 'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome']

Number of Missing values:   0

Number of unique values :
 Pregnancies                  17
Glucose                     136
BloodPressure                47
SkinThickness                51
Insulin                     186
BMI                         248
DiabetesPedigreeFunction    517
Age                          52
Outcome                       2
dtype: int64

In [ ]:
df.describe()

       Pregnancies     Glucose  ...         Age     Outcome
count   768.000000  768.000000  ...  768.000000  768.000000
mean      3.845052  120.894531  ...   33.240885    0.348958
std       3.369578   31.972618  ...   11.760232    0.476951
min       0.000000    0.000000  ...   21.000000    0.000000
25%       1.000000   99.000000  ...   24.000000    0.000000
50%       3.000000  117.000000  ...   29.000000    0.000000
75%       6.000000  140.250000  ...   41.000000    1.000000
max      17.000000  199.000000  ...   81.000000    1.000000

[8 rows x 9 columns]

In [ ]:
df.columns

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

## Cleaning data in a dataframe: 
1. Dealing with missing values
2. Data in wrong format
3. Wrong data
4. Duplicates

###Dealing with missing values : 

Handling missing values is an essential part of data cleaning and preparation process since almost all data in real life comes with some missing values.

###Check for missing values

In [ ]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
Outcome                     0
dtype: int64

 Let's create a daframe with missing values.

In [ ]:
df2 = df
df2.Glucose.replace(99, np.nan, inplace=True)
df2.BloodPressure.replace(74, np.nan, inplace=True)

print ('\nNumber of Missing values:  ', df2.isnull().sum())
print ('\nTotal number of missing values :  ', df2.isnull().sum().values.sum())

Valeurs manquantes:   Pregnancies                  0
Glucose                     17
BloodPressure               52
SkinThickness                0
Insulin                      0
BMI                          0
DiabetesPedigreeFunction     0
Age                          0
Outcome                      0
dtype: int64

Valeurs manquantes total:   69

###First strategy : Removing the whole row that contains a missing value

In [ ]:
# Removing the whole row
df3 = df2.dropna()

print ('\nValeurs manquantes:  ', df3.isnull().sum())
print ('\nValeurs manquantes total:  ', df3.isnull().sum().values.sum())

Valeurs manquantes:   Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
Outcome                     0
dtype: int64

Valeurs manquantes total:   0

In [ ]:


##Replace the missing values

df2.Glucose.replace(np.nan, df['Glucose'].median(), inplace=True)
df2.BloodPressure.replace(np.nan, df['BloodPressure'].median(), inplace=True)

##Sorting the data

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html

In [ ]:
#Trier les données
b = df.sort_values('Pregnancies')
b.head()

     Pregnancies  Glucose  ...  Age  Outcome
467            0       97  ...   25        0
109            0       95  ...   24        1
452            0       91  ...   25        0
449            0      120  ...   26        0
448            0      104  ...   22        1

[5 rows x 9 columns]

**Exercise :** Sort the data in descending order according to the insulin level and store the data in a new Data frame. How to store the data in the same dataframe?

## Subseting the data

In [ ]:
df[df['BloodPressure'] >70].count() # Filtrage par valeur

Pregnancies                 393
Glucose                     393
BloodPressure               393
SkinThickness               393
Insulin                     393
BMI                         393
DiabetesPedigreeFunction    393
Age                         393
Outcome                     393
dtype: int64

In [ ]:
df_court = df[['Insulin','Glucose']]

df_court.drop('Insulin', inplace= True, axis = 1)

df_court.head()

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

   Glucose
0      148
1       85
2      183
3       89
4      137

## Statistics applied to dataframes

DataFrame.aggregate(func=None, axis=0, *args, **kwargs)
Aggregate using one or more operations over the specified axis.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html